yuanwil1y/esp32c6-Pwnagotchi/sdkconfig.defaults
# Phase 0 baseline derived from Waveshare 08_FactoryProgram.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_FREERTOS_HZ=1000

# Waveshare's SH8601/LVGL path uses RGB565 byte swap.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
